<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Description</key>
    <string>Downloads the latest version of Druva inSync Cloud for macOS.</string>
    <key>Identifier</key>
    <string>com.github.jprichards.download.inSync</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>inSync</string>
        <key>POSTED_URL</key>
        <string>https://docs.druva.com/001_inSync_Cloud/Cloud/010_Release_Details/025_Download_Links</string>
        <key>SEARCH_PATTERN_1</key>
        <string>href="(?P&lt;posturl&gt;.*insync\/client\/cloud\/.*\/)"</string>
        <key>SEARCH_PATTERN_2</key>
        <string>href="(?P&lt;dlurl&gt;.*/downloads/inSync\/MAC\/(?P&lt;shortversion&gt;.*)\/inSync\-(?P&lt;longversion&gt;.*)\.dmg)"</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%POSTED_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN_1%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%posturl%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN_2%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%dlurl%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Install inSync.mpkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Druva Technologies PTE LTD (JN6HK3RMAP)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
