<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Description</key>
    <string>Downloads the latest version of Druva inSync Cloud for macOS.</string>
    <key>Identifier</key>
    <string>com.github.jprichards.download.inSync</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>inSync</string>
        <key>POSTED_URL</key>
        <string>https://docs.druva.com/001_inSync_Cloud/Cloud/010_Release_Details/025_Download_Links</string>
        <key>SEARCH_PATTERN_1</key>
        <string>href="(?P&lt;posturl&gt;.*insync\/client\/cloud\/.*\/)"</string>
        <key>SEARCH_PATTERN_2</key>
        <string>href="(?P&lt;dlurl&gt;.*/downloads/inSync\/MAC\/(?P&lt;shortversion&gt;.*)\/(?P&lt;filename&gt;inSync\-(?P&lt;longversion&gt;.*))\.dmg)"</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%POSTED_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN_1%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%posturl%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN_2%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%dlurl%</string>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>%USER_AGENT%</string>
                </dict>
                <key>filename</key>
                <string>%filename%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
